{
  "header": {
    "home": "Галоўная",
    "about": "Пра мяне",
    "skills": "Навыкі",
    "portfolio": "Партфоліё",
    "contacts": "Кантакты"
  },
  "main": {
    "home": {
      "name": "Максім Бекіш",
      "about": "Фронтэнд-распрацоўка 26 гадоў, Мінск"
    },
    "about": {
      "a": "Я навучаюся ў SF на курсе 'FrontEnd Pro'.",
      "b": "У свабодны час водзім свой праект разам з камандай.",
      "c": "Мне цікава стварэнне вэб-прыкладанняў з выкарыстаннем JavaScript/TypeScript і React.",
      "d": "Я камунікатыўны, стрэмлюся да пастаяннага развіцця і адаптуцца да новых тэхналогій.",
      "e": "Гатовы прымаць на сябе адказнасць і спрыяць развіццю праектаў і кампаній."
    },
    "portfolio": {
      "dataTable": {
        "name": "Табліца дадзеных(React)",
        "description": {
          "a": "React і функцыянальныя кампаненты для чыстага і кампактнага коду.",
          "b": "Вэрстка адпавядае макету, выкарыстанне стандартных правілаў SCSS і styled-components для стылізацыі.",
          "c": "Кастамізацыя элементаў бібліятэкі Ant Design для стварэння зручнага інтэрфейсу.",
          "d": "Магчымасць выбару паміж дзённай і ночнай тэмай праз useContext.",
          "e": "Праца з рознымі тыпамі дадзеных: тэкставымі, лікавымі, выпадальным спісам і чэкбоксамі з адпаведнымі кампанентамі.",
          "f": "Складнасць заключалася ў рэалізацыі тэм (дзень/ноч). Рашыў з дапамогай styled-components, useState і useContext."
        }
      },
      "snake": {
        "name": "Змяя(Гульня)",
        "description": {
          "a": "Выкарыстанне элемента <canvas> для стварэння гульнявага поля.",
          "b": "HTML і CSS для асноўнай структуры і візуальнага ўпрыгожнення",
          "c": "JavaScript для кіравання логікай і візуалізацыяй гульні.",
          "d": "Даданне функцыяналу, налада хуткасці змяйкі з дапамогай JavaScript",
          "e": "Выкарыстанне лакальнага захоўвання браўзэра для захоўвання імя гульца і лепшага выніку",
          "f": "Складанасць узнікла з кіраваннем жыццёвага цыклу гульні. Рашэнне было такое. Функцыя run() адказвае за пачатак гульні. Запускае таймер зваротнага адліку перад пачаткам гульні і вызывае функцыю gameLoop() пасля завяршэння зваротнага адліку. Функцыя gameLoop() асноўны гульнявы цыкл, які абнаўляе і адлюстроўвае гульнявыя элементы з пэўнай частатай. Выклікаецца пасля завяршэння таймера зваротнага адліку. Выкарыстоўвае requestAnimationFrame для паўторнага выкліку сябе і абнаўлення стану гульні. Апрацоўчыкі падзей клавіятуры рэагуюць на націск клавіш і змяняюць напрамак руху змяйкі."
        }
      },
      "designProject": {
        "name": "Студыя дызайну інтэр'ера",
        "description": {
          "a": "Вэрстка выканана ў адпаведнасці з макетам з Figma, а для стылізацыі элементаў выкарыстоўваў SCSS.",
          "b": "Стварыў формы для ўводу дадзеных і адпраўкі на сервер.",
          "c": "Для забеспячэння адаптыўнасці сайта выкарыстоўваў семантычныя тэгі і медыя-запыты.",
          "d": "Рэалізаваў слайдер для фатаграфій і інфармацыі на JavaScript.",
          "e": "Пры стварэнні слайдера на JavaScript узніклі складнасці з кіраваннем рухам слайдаў, сінхранізацыяй элементаў і апрацоўкай падзей націскання. Я выкарыстоўваў метады працы з DOM, CSS уласцівасць transform для анімацыі, масівы і цыклы для кіравання элементамі і апрацоўчыкі падзей для навігацыі."
        }
      },
      "chart": {
        "name": "Графік (React)",
        "description": {
          "a": "Функцыянальныя компаненты ў React: Паляпшэнне мадульнасці і чытаемасці кода.",
          "b": "Семантычныя тэгі ў верстцы: Павышэнне даступнасці сайта і паляпшэнне SEO.",
          "c": "Інтэграцыя SVG-графікі: Даданне прывабных візуальных элементаў.",
          "d": "JJavaScript і SVG для інтэрактыўнасці: Паляпшэнне вопыту карыстальніка і функцыянальнасці прыкладання."
        }
      },
      "youTalk": {
        "name": "YouTalk",
        "description": {
          "a": "Пры верстцы праекта выкарыстоўваў макет Figma. Чысты CSS з дадаткам тэхнік, такіх як грыды і флэксбокс.",
          "b": "Выкарыстанне семантычных тэгаў, такіх як <header>, <nav>, <section>, <article>, <footer>, каб код быў зразумелым і лёгка чытаемым як для распрацоўшчыкаў, так і для пошукавых сістэм.",
          "c": "Выкарыстанне грыдаў і флэксбокса дазволіла мне стварыць адаптыўную верстку. Выкарыстоўваў псеўдакласы, каб дадаць інтэрактыўныя эфекты.",
          "d": "У выніку мая верстка адаптавана пад усе прылады і прадастаўляе прыемны і інтуітыўна зразумелы інтэрфейс."
        }
      },
        "link": "Спасылка на праект",
      "sectionLeft": {
        "photo": "Фота",
        "description": "Апісанне"
      }
    }
  },
  "footer": {
    "title": "Хочаце даведацца больш або проста пагаварыць?",
    "button": "Адправіць СМС",
    "end": "Я таксама чакаю вас у маіх сацыяльных сетках."
  }
}