{
  "header": {
    "home": "Галоўная",
    "about": "Пра мяне",
    "skills": "Навыкі",
    "portfolio": "Партфоліа",
    "contacts": "Кантакты"
  },
  "main": {
    "home": {
      "name": "Максім Бекіш",
      "about": "Фронтэнд-распрацоўка 26 гадоў, Мінск"
    },
    "about": {
      "a": "Я вучуся ў SF на курсе 'FrontEnd Pro'.",
      "b": "У вольны час рэалізуем разам з камандай свой праект.",
      "c": "Захапляюся стварэннем вэб-дададкаЎ з выкарыстаннем JavaScript/TypeScript і React.",
      "d": "Я камунікатыўны, імкнуся да пастаяннага развіцця і адапціруюся да новых тэхналогій.",
      "e": "Гатоў браць на сябе адказнасць і ўделінічаць у стварэнні праектаў для развіцця кампаній."
    },
    "portfolio": {
      "dataTable": {
        "name": "Табліца дадзеных(React)",
        "description": {
          "a": "React і функцыянальныя кампаненты для чыстага і кампактнага кода.",
          "b": "Вёрстка адпавядае макету і выкарыстаны стандартныя правілы SCSS і styled-components для стылізацыі.",
          "c": "Кастамізацыя элементаў бібліятэкі Ant Design для стварэння зручнага інтэрфейса.",
          "d": "Магчымасць выбару паміж дзённай і начной тэмай праз useContext.",
          "e": "Праца з рознымі тыпамі дадзеных: тэкставымі, лікавымі, выпадальным спісам і чэкбоксамі з адпаведнымі кампанентамі.",
          "f": "Складнасць заключалася ў рэалізацыі тэм (дзень/ноч). Праблема была вырашана з дапамогай styled-components, useState і useContext."
        }
      },
      "snake": {
        "name": "Змяя(Гульня)",
        "description": {
          "a": "Выкарыстанне элемента <canvas> для стварэння гульнявога поля.",
          "b": "HTML і CSS для асноўнай структуры і візуальнага ўпрыгожвання",
          "c": "JavaScript для кіравання логікай і візуалізацыяй гульні.",
          "d": "Дабаулены функцыянал для наладжвання хуткасці змейкі з дапамогай JavaScript",
          "e": "Лакальнага захоўвання выкарыстанна для запамінання імені гульца і лепшага выніку",
          "f": "Складанасць узнікла з кіраваннем жыццёвага цыкла гульні. Рашэнне было наступнае: функцыя run() адказвае за пачатак гульні, запускае таймер зваротнага адліку перад пачаткам гульні і выклікае функцыю gameLoop() пасля завяршэння зваротнага адліку. Функцыя gameLoop() - асноўны гульнявы цыкл, які абнаўляе і адлюстроўвае гульнявыя элементы з пэўнай частатай. Выклікаецца пасля завяршэння таймера зваротнага адліку. Функцыя gameLoop() выкарыстоўвае requestAnimationFrame для паўторнага выкліку сябе і абнаўлення стану гульні. Апрацоўшчыкі падзей клавіятуры рэагуюць на націск клавіш і змяняюць напрамак руху змейкі."
        }
      },
      "designProject": {
        "name": "Студыя дызайну інтэр'ера",
        "description": {
          "a": "Вёрстку выкананау ў адпаведнасці з макетам з Figma, а для стылізацыі элементаў выкарыстоўваў SCSS.",
          "b": "Стварыў формы для ўводу дадзеных і адпраўкі на сервер.",
          "c": "Для забеспячэння адаптаванасці сайта выкарыстоўваў семантычныя тэгі і медыя-запыты.",
          "d": "Рэалізаваў слайдэр для фотаздымкаў і інфармацыі на JavaScript.",
          "e": "Пры стварэнні слайдэра на JavaScript узніклі складнасці з кіраваннем рухам слайдаў, сінхранізацыяй элементаў і апрацоўкай падзей націскання. Я выкарыстоўваў метады працы з DOM, CSS уласцівасць transform для анімацыі, масівы і цыклы для кіравання элементамі і апрацоўшчыкі падзей для навігацыі."
        }
      },
      "chart": {
        "name": "Графік (React)",
        "description": {
          "a": "Выкарастаны:",
          "b": "Функцыянальныя компаненты ў React для паляпшэнне мадульнасці і чытаемасці кода.",
          "c": "Семантычныя тэгі ў верстцы для павышэнне даступнасці сайта і паляпшэнне SEO.",
          "d": "Інтэграцыя SVG-графікі для даданне прывабных візуальных элементаў.",
          "e": "JavaScript для інтэрактыўнасці."
        }
      },
      "youTalk": {
        "name": "YouTalk",
        "description": {
          "a": "Пры верстцы праекта выкарыстоўваў макет Figma. Чысты CSS з дадаткам тэхнік, такіх як грыды і флэксбокс.",
          "b": "Семантычныя тэгі, такіх як <header>, <nav>, <section>, <article>, <footer>, выкарыстоўваліся для таго, каб код быў зразумелым для распрацоўшчыкаў, і для пошукавых сістэм.",
          "c": "Адапдаванная верстка стрворана с дапамогай Grid і FlexBox. Выкарыстоўваліся псеўдакласы, каб стварыць інтэрактыўныя эфекты.",
          "d": "У выніку верстка адаптавана пад усе прылады і ўяўляе прыемны і інтуітыўна зразумелы інтэрфейс."
        }
      },
      "link": "Спасылка на праект",
      "sectionLeft": {
        "photo": "Фота",
        "description": "Апісанне"
      }
    }
  },
  "footer": {
    "title": "Хочаце даведацца больш або проста пагаварыць?",
    "button": "Адправіць СМС",
    "end": "Я таксама чакаю вас у маіх сацыяльных сетках."
  }
}